app/controllers/students_controller.rb

  def show
     id = params[:id]
     @student = Student.find(id)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 0]]

  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'first'
      ordering,@first_header = {:first => :asc}, 'bg-warning hilite'
    when 'last'
      ordering,@last_header = {:last => :asc}, 'bg-warning hilite'
    end
    @all_years = Student.all_years
    @selected_years = params[:years] || session[:years] || {}

    if @selected_years == {}
      @selected_years = Hash[@all_years.map {|year| [year, year]}]
---
SELECT "students".* FROM "students" WHERE "students"."year" IN ('2021', '2022', '2023', '2024', '2025')

  def create
    @student = Student.create!(student_params)
---
INSERT INTO "students" ("first", "last", "CWID", "year", "semester", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["first", ""], ["last", ""], ["CWID", ""], ["year", ""], ["semester", ""], ["created_at", "2020-11-08 21:27:47.664824"], ["updated_at", "2020-11-08 21:27:47.664824"]]